[
  {
    "movieName": "Spirited Away",
    "director": "Hayao Miyazaki",
    "plot": "Spirited Away tells the story of Chihiro Ogino (Hiiragi), a ten-year-old girl who, while moving to a new neighborhood, enters the world of Kami (spirits of Japanese Shinto folklore).[8] After her parents are turned into pigs by the witch Yubaba (Natsuki), Chihiro takes a job working in Yubaba's bathhouse to find a way to free herself and her parents and return to the human world. "
  },
  {
    "movieName": "The Lion King",
    "director": "Roger Allers, Rob Minkoff",
    "plot": "Set in a kingdom of lions in Africa, The Lion King tells the story of Simba (Swahili for lion), a lion cub who is to succeed his father, Mufasa, as King of the Pride Lands; however, after his paternal uncle Scar kills Mufasa to seize the throne, Simba is tricked into believing he was responsible for his father's death and flees into exile. After growing up in the company of the carefree outcasts Timon and Pumbaa, Simba receives valuable perspective from his childhood friend, Nala, and his shaman, Rafiki, before returning to challenge Scar to end his tyranny and take his place in the Circle of Life as the rightful king. "
  },
  {
    "movieName": "Spider-Man: Into the Spider-Verse",
    "director": "Bob Persichetti, Peter Ramsey, Rodney Rothman",
    "plot": "The film's story follows Miles Morales as he becomes the new Spider-Man and joins other Spider-People from various parallel universes to save his universe from Kingpin."
  },
  {
    "movieName": "Coco",
    "director": "Lee Unkrich",
    "plot": "The story follows a 12-year-old boy named Miguel (Gonzalez) who is accidentally transported to the Land of the Dead, where he seeks the help of his deceased musician great-great-grandfather to return him to his family among the living and to reverse his family's ban on music."
  },
  {
    "movieName": "Monsters, Inc",
    "director": "Peter Docter",
    "plot": " The film centers on two monsters, the hairy James P. \"Sulley\" Sullivan (Goodman) and his one-eyed partner and best friend Mike Wazowski (Crystal), who are employed at the titular energy-producing factory Monsters, Inc., which generates power by scaring human children. However, the monster world believes that the children are toxic, and when a little human girl Boo (Gibbs) sneaks into the factory, she must be returned home before it is too late."
  },
  {
    "movieName": "Puss in Boots: The Last Wish",
    "director": "Joel Crawford",
    "plot": "In the film, after the events of Shrek Forever After (2010), Puss in Boots teams up with Kitty and Perrito (Guillén) to find the mystical Last Wish for the Wishing Star to restore the first eight of his nine lives, before Goldilocks and her Three Bears Crime Family (Pugh, Winstone, Colman, and Kayo), and \"Big\" Jack Horner (Mulaney) do, while attempting to avoid a mysterious hooded wolf (Moura)."
  },
  {
    "movieName": "Pinocchio",
    "director": "Robert Zemeckis",
    "plot": "The story follows a wooden puppet named Pinocchio (Evan Ainsworth), who is brought to life by a blue fairy (Erivo) after being crafted by an old Italian woodcarver named Geppetto (Hanks). While the role of Pinocchio's conscience Jiminy Cricket (Gordon-Levitt) attempts to guide Pinocchio in matters of right and wrong, Pinocchio encounters a host of unsavory characters in his efforts to become a real boy."
  },
  {
    "movieName": "Rango",
    "director": "Gore Verbinski",
    "plot": "The film's plot centers on Rango (Depp), a chameleon who accidentally ends up in the town of Dirt, an outpost that is in desperate need of a new sheriff."
  },
  {
    "movieName": "Brave",
    "director": "Mark Andrews, Brenda Chapman",
    "plot": "Set in the Scottish Highlands, the film tells the story of Princess Merida of DunBroch (Macdonald) who defies an age-old custom, causing chaos in the kingdom by expressing the desire not to be betrothed. When Queen Elinor (Thompson), her mother, falls victim to a beastly curse and turns into a bear, Merida must look within herself and find the key to saving the kingdom. Merida is the first Disney Princess created by Pixar"
  },
  {
    "movieName": "Rio",
    "director": "Carlos Saldanha",
    "plot": "It tells the story of Blu (Eisenberg), a domesticated male Spix's macaw who is taken to Rio de Janeiro to mate with a free-spirited female Spix's macaw, Jewel (Hathaway). The two eventually fall in love, and together they have to escape from being smuggled by Nigel (Clement), a cockatoo."
  }
]
